"""
Частина 2. Налаштування реплікації у Cassandra

1. Сконфігурувати кластер з 3-х нод:
2. Перевірити правильність конфігурації за допомогою nodetool status
3. Викоритовуючи cqlsh, створити три Keyspace з replication factor 1, 2, 3 з SimpleStrategy
4. В кожному з кейспейсів створити прості таблиці

1. Спробуйте писати і читати в ці таблиці підключаюсь до різних нод через cqlsh.
2. Вставте дані в створені таблиці і подивіться на їх розподіл по вузлах кластера окремо для кожного з кейспесов
    (команда nodetool status) - має бути видно відсоток даних який зберігається на ноді
3. Для якогось запису з кожного з кейспейсу виведіть ноди на яких зберігаються дані
    - має бути видно ip-адреси вузлів на яких зберігається даний рядок

1. Відключити одну з нод. Для кожного з кейспейсів перевірити з якими рівнями consistency можемо читати та писати
    - для Keyspace з replication factor 1 - CONSISTENCY ONE
    - для Keyspace з replication factor 2 - CONSISTENCY ONE/TWO
    - для Keyspace з replication factor 3 - CONSISTENCY ONE/TWO/THREE

1. Зробить так щоб три ноди працювали, але не бачили одна одну по мережі (заблокуйте чи відключити зв'язок між ними)
2. Для кейспейсу з replication factor 3 задайте рівень consistency рівним 1.
    Виконайте по черзі запис значення з однаковим primary key, але різними іншими значенням окремо на кожну з нод (тобто створіть конфлікт)
3. Відновіть зв'язок між нодами, і перевірте що вони знову об'єдналися у кластер.
    Визначте яким чином була вирішений конфлікт даних та яке значення було прийнято кластером та за яким принципом
"""
