"""
Частина 3. Аналіз продуктивності та перевірка цілісності

Аналогічно попереднім завданням, необхідно, для кластеру налаштованому у попередній частині, створити таблицю з каунтером лайків.
Далі з 10 окремих клієнтів одночасно запустити інкерементацію каунтеру лайків по 10_000 на кожного клієнта з різними опціями взаємодії з Cassandra.

Таблиця має бути створена у Keyspace з replication factor 3.

Для створення каунтеру використовуйте спеціальний тип колонки - counter (цей тип буде підтримувати операції increment/decrement in-place):

1. Вказавши у параметрах запиту Consistency Level One (це буде означати, що запис відбувається синхронно тільки на одну ноду),
    запустіть 10 клієнтів з інкрементом по 10_000 на кожному з них.
    Виміряйте час виконання та перевірте чи кінцеве значення буде дорівнювати очікуваному - 100К
2. Вказавши у параметрах запиту Consistency Level QUORUM (це буде означати, що запис відбувається синхронно на більшість нод),
    запустіть 10 клієнтів з інкрементом по 10_000 на кожному з них.
    Виміряйте час виконання та перевірте чи кінцеве значення буде дорівнювати очікуваному - 100К
"""