"""
Частина 1. Робота зі структурами даних у Cassandra

Створіть keyspace з найпростішої стратегією реплікації

В цьому keyspace необхідно буде створити дві таблиці: items та orders

Таблиця items містить різноманітні товари (тобто у яких різний набір властивостей).

Для набору властивостей товару виберіть базові характеристики однакові для всіх товарів (name, category, price, producer, ...),
а для властивостей які відрізняються використовуйте тип map (створивши індекс для можливості пошуку по її вмісту)

Увага: Необхідно, щоб пошук швидко працював для категорії (category) товарів. Ця вимога має бути врахована при створенні ключа для таблиці (тобто, category має бути partition key).
Наповніть таблиці тестовими данними

!!! У запитах заборонено використовувати ALLOW FILTERING !!!
    1. Напишіть запит, який показує структуру створеної таблиці (команда DESCRIBE)
    2. Напишіть запит, який виводить усі товари в певній категорії відсортовані за ціною
    3. Напишіть запити, які вибирають товари за різними критеріями в межах певної категорії (тут де треба замість індексу використайте Matirialized view):
        - назва,
        - ціна (в проміжку),
        - ціна та виробник

Створіть таблицю orders в якій міститься ім'я замовника і інформація про замовлення: перелік id-товарів у замовленні, вартість замовлення, дата замовлення, ....

Для кожного замовника повинна бути можливість швидко шукати його замовлення і виконувати по них запити.
Ця вимога має бути врахована при створенні ключа для таблиці (аналогічно як для items).
    1. Напишіть запит, який показує структуру створеної таблиці (команда DESCRIBE)
    2. Для замовника виведіть всі його замовлення відсортовані за часом коли вони були зроблені
    3. Для кожного замовників підрахуйте загальну суму на яку були зроблені усі його замовлення
    4. Для кожного замовлення виведіть час коли його ціна були занесена в базу (SELECT WRITETIME)
"""
